import {React,useState} from 'react';

const DesceriptionsPreduct = (props) => {
    const[readMe,setReadMe] = useState (false);
    const readMeBtn = () => {
        setReadMe(!readMe)
    }
    return (
        <div id={props.id} className="desceriptions bg-white p-2">
        <section className="header-desceription px-3 py-3">
            <h2 > معرفی چوب راکت ویسکاریا (Viscaria) </h2>
         </section>
         <section>
             <h4 className='px-4 mx-3 fw-700 letter-spacing'> معرفی کوتاه</h4>
             {readMe && 
             <div>
                <p id='text' className='p-desceriptions'>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
                                 </p>
             </div>
             }
             <button type='button' onClick={readMeBtn} className='fs-4 btn btn-readMe btn-danger text-white w-100 mx-auto d-block'>
              {readMe ? "مخفی کردن" : "نمایش کامل"}
             </button>
         </section>
        </div> 
    );
}

export default DesceriptionsPreduct;
